index.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="readtheorg.css"/>
#+HTML_HEAD: <script src="https://cdn.jsdelivr.net/npm/jquery@3.4.1/dist/jquery.slim.min.js"></script>
#+HTML_HEAD: <script src="https://cdn.jsdelivr.net/npm/bootstrap@3.4.1/dist/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript">$('document').ready(function(){$('#text-table-of-contents ul').first().addClass('nav');$('body').scrollspy({target:'#text-table-of-contents'});});</script>

#+TITLE: Exuanbo's Wiki
#+AUTHOR: Exuanbo

#+BEGIN_CENTER
This document is built using Emacs [[https://orgmode.org/][Org mode]] with the [[https://github.com/fniessen/org-html-themes][ReadTheOrg]] theme, inspired by [[https://geekplux.com/][GeekPlux]]. I'm still learning and exploring this amazing tool.
#+END_CENTER

- [[http://catb.org/~esr/faqs/hacker-howto.html][How To Become A Hacker]]
- [[http://www.catb.org/~esr/faqs/smart-questions.html][How To Ask Questions The Smart Way]]
- [[https://uses.tech/][/uses]] - A list of /uses pages detailing developer setups, gear, software and configs

* Life
** Minimalism
** IME
*** 双拼
- [[https://sspai.com/post/33019][选择输入法的哲学：兼论双拼的优缺点 - 少数派]]
  - 录入文字的过程可以简单分为两个环节：1. 大脑将思考的内容转化为可以通过键盘录入的内容（比如字形、字音）；2. 通过键盘将字形或字音录入电脑并组合为最终文字。
  - *我们的大脑更容易把思维转化为声音而不是文字* ，甚至有很多人必须先把思维转化为声音然后才能进一步转化为文字：我们见过很多人在输入的时候嘴里念念有词，这就是通过声音来辅助文字呈现的一种方式，但我们从来没见过有人说话的时候，需要拿支笔边写边说。
  - 双拼输入法是拼音输入法的一种，因此它继承了拼音输入法在第一环节的优势；而由于简化了复合声母和韵母，在第二环节的效率追平甚至超过了五笔输入法。

**** Practice
- 强制替换电脑和手机上的输入法
- 打印键位并贴到墙上
- 使用讯飞输入法键位皮肤
- 微信聊天背景设为键位图

**** Resource
- [[https://www.flypy.com/][小鹤双拼·小鹤音形 - 官方网站]]

*** RIME
**** Squirrel
- [[https://github.com/placeless/squirrel_config][placeless/squirrel_config]] - Rime 鼠须管小鹤双拼配置
- [[https://github.com/cnfeat/Rime][cnfeat/Rime]] - 鼠须管 小鹤双拼 输入法配置及配色方案

** Bypass GFW
- [[https://www.v2ray.com/][V2Ray]]
  - [[https://guide.v2fly.org/advanced/wss_and_web.html][WebSocket + TLS + Web]]
- [[https://github.com/trojan-gfw/trojan][trojan-gfw/trojan]]
- [[https://github.com/TheWanderingCoel/Trojan-Qt5][TheWanderingCoel/Trojan-Qt5]] - Windows, macOS, Linux
- [[https://github.com/yichengchen/clashX/tree/master][ClashX]] - macOS
- [[https://apps.apple.com/us/app/shadowrocket/id932747118][Shadowroket]] - iOS
- [[https://github.com/Hackl0us/SS-Rule-Snippet][Hackl0us/SS-Rule-Snippet]] - Surge / Quantumult / Shadowrocket / Surfboard / clash(X) 实用规则
- [[https://github.com/geekdada/surgio][geekdada/surgio]] - Generating rules for Surge, Clash, Quantumult... like a PRO

** Marathon
- 知乎圆桌[[https://www.zhihu.com/roundtable/marathon2015/][《马拉松之路》]]
- [[https://www.zhihu.com/question/21557037][有哪些配合马拉松训练的核心力量训练项目或计划？ - 知乎]]
  - 核心力量训练是指针对核心区域肌肉（主要是腹部、下背部和骨盆部肌群）及其深层小肌肉进行的力量、稳定、平衡等能力的训练，它不同于传统的腰腹力量训练，而是使核心区域的整体原动肌和局部稳定肌均能通过训练得到发展和提高。核心力量训练的目的就是使整个机体协调起来，确保训练者在做动作时核心肌群起到稳定躯体，传输能量的作用。
- [[https://www.zhihu.com/question/62561329][越野跑和公路跑有哪些区别？ - 知乎]]
- [[http://thespiral.fm/episodes/4][Episode 004 — 当我们谈跑步时，我们谈些什么]]
  - 跑步是对现实生活的逃避，是一种解脱或者说移情。
- 动画[[https://movie.douban.com/subject/30238385/][《强风吹拂》]]
  - [[http://thespiral.fm/episodes/5][Episode 005 — 纵使强风起，人生不言弃]]
    - 对一个跑者的最高赞美是什么。快吗？我觉得应该是强。
    - 无论你处于什么立场、曾经有过什么样的遭遇，面对跑步这件事，所有人都得站在同一条起跑线上。不论最后是成功或失败，在这个当下，都取决于自己这幅身躯。正因为如此，才会有快乐，有痛苦，最后是无上的自由。

** Podcast
- [[https://sspai.com/post/58577][播客届的京派与海派 - 少数派]]
  - 时隔近百年，当下的中文播客圈，听众之中流行着一个说法，将中文播客分类为「陪伴型 / 湿货」和「硬核型 / 干货」两种类型。苹果发布的 2019 年最佳中文播客榜单中，不乏「大内密谈」「日谈公园」「跟宇宙结婚」这样的「闲话类」陪伴型播客，也丰盈着「忽左忽右」「博物志」「声东击西」「不可理论」等信息度相对密集、知识点充沛的播客节目。前者往往以北京为核心，主要是北方语系；后者则以上海为中心，且基本有海外背景。

*** App
泛用型播客客户端：
- [[https://castro.fm/][Castro]] - iOS | Recommand
- [[https://overcast.fm/][Overcast]] - iOS
- [[https://www.pocketcasts.com/][Pocket Casts]] - Android & iOS

*** Explore
- [[https://letter.getpodcast.xyz/][播客 Feed 订阅]]
- [[https://typlog.com/podlist/][中文独立播客]] - 发现与推荐高质量的中文独立播客

Jesse Chan ([[https://twitter.com/Jesoooor][@Jesoooor]]) 言：
#+begin_quote
独立 = 创作过程不受限制、影响。

这个限制和影响可能来自资本、技术、商业、受众。但你不可能找到一个一刀切的标准来定义「独立」。

小众厂牌 Spotify 独占，能叫独立音乐吗？微软独占的《Cuphead》叫独立游戏吗？

这是要从内容本身出发去判断的，真正「独立」的内容会散发出独一无二的气质。
#+end_quote

