index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-03-05 Thu 23:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Exuanbo's Wiki</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Exuanbo">
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Exuanbo's Wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6cbd3a8">1. Life</a>
<ul>
<li><a href="#orgaece545">1.1. Minimalism</a></li>
<li><a href="#orgcac063a">1.2. IME</a>
<ul>
<li><a href="#org3aa4653">1.2.1. 双拼</a></li>
<li><a href="#org5b17d60">1.2.2. RIME</a></li>
</ul>
</li>
<li><a href="#org3f8442d">1.3. Bypass GFW</a></li>
<li><a href="#org009d1f1">1.4. Marathon</a></li>
<li><a href="#org69d3a45">1.5. Podcast</a>
<ul>
<li><a href="#org0f5a4ce">1.5.1. App</a></li>
<li><a href="#org8b43f37">1.5.2. Explore</a></li>
<li><a href="#org8d0de1a">1.5.3. Subscription</a></li>
<li><a href="#org5cb3d74">1.5.4. Episode</a></li>
</ul>
</li>
<li><a href="#org78894c2">1.6. Subscriptions</a>
<ul>
<li><a href="#orga831de8">1.6.1. App</a></li>
<li><a href="#orgf365515">1.6.2. Web Service</a></li>
<li><a href="#orge1cccef">1.6.3. Entertainment</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf38f03f">2. Job</a>
<ul>
<li><a href="#org55fb3f7">2.1. Prepare</a>
<ul>
<li><a href="#org55b0e5d">2.1.1. Interview</a></li>
</ul>
</li>
<li><a href="#orgf23ea96">2.2. Resource</a></li>
<li><a href="#orgd559e11">2.3. Experience</a></li>
</ul>
</li>
<li><a href="#org5583442">3. Language Learning</a>
<ul>
<li><a href="#org7f73a7a">3.1. English</a>
<ul>
<li><a href="#org126afff">3.1.1. Vocabulary</a></li>
<li><a href="#org2400ee6">3.1.2. Grammar</a></li>
<li><a href="#org3335d3f">3.1.3. Listening</a></li>
<li><a href="#orge1b12d2">3.1.4. Reading</a></li>
<li><a href="#org2c93afc">3.1.5. Speaking</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd811ab3">4. Reading</a>
<ul>
<li><a href="#orgc6307f0">4.1. Magazine</a></li>
<li><a href="#orgab0eb3c">4.2. Blog</a></li>
</ul>
</li>
<li><a href="#org224f2a0">5. Writing</a></li>
<li><a href="#org5d1ce7a">6. Design</a></li>
<li><a href="#org1927b58">7. Open Source</a></li>
<li><a href="#org7d57da3">8. Computer Science</a></li>
<li><a href="#orgf22d7a7">9. Programming</a></li>
<li><a href="#orga4db964">10. Web</a>
<ul>
<li><a href="#org59b2a47">10.1. CSS</a></li>
<li><a href="#org7a6947c">10.2. Nginx Configuration</a>
<ul>
<li><a href="#orge4a3f80">10.2.1. nginx.conf</a></li>
</ul>
</li>
<li><a href="#org7560ba5">10.3. Resource</a></li>
</ul>
</li>
<li><a href="#org35ac533">11. iOS</a></li>
<li><a href="#org25f1b9c">12. Game</a>
<ul>
<li><a href="#org0b297ca">12.1. Development</a></li>
</ul>
</li>
<li><a href="#orgd3add23">13. Git</a>
<ul>
<li><a href="#orgfa16953">13.1. Pull-Request steps</a></li>
<li><a href="#orgcfef305">13.2. Github Pages</a></li>
<li><a href="#orgb85c579">13.3. Command</a></li>
</ul>
</li>
<li><a href="#orgf54da15">14. Text Editor</a>
<ul>
<li><a href="#org8422bc9">14.1. Emacs</a></li>
<li><a href="#org828559c">14.2. Spacemacs</a>
<ul>
<li><a href="#org8377144">14.2.1. Dotfile Configuration</a></li>
<li><a href="#org74ed3a4">14.2.2. Tips</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfa0e51f">15. Org Mode</a></li>
<li><a href="#orgaf727a0">16. LaTeX</a></li>
<li><a href="#org947997c">17. OS</a>
<ul>
<li><a href="#orgc96919b">17.1. Linux</a></li>
<li><a href="#org51505ee">17.2. MacOS</a>
<ul>
<li><a href="#org48d6941">17.2.1. Setup</a></li>
</ul>
</li>
<li><a href="#orgde6c7d9">17.3. Windows</a></li>
</ul>
</li>
<li><a href="#org2f55f7d">18. Self-hosting</a>
<ul>
<li><a href="#org920aa99">18.1. Analytics</a>
<ul>
<li><a href="#orgde51e42">18.1.1. Ackee</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
This document is built using Emacs <a href="https://orgmode.org/">Org mode</a> with the <a href="https://github.com/fniessen/org-html-themes">ReadTheOrg</a> theme, inspired by <a href="https://geekplux.com/">GeekPlux</a>. I'm still learning and exploring this amazing tool.
</p>
</div>

<ul class="org-ul">
<li><a href="http://catb.org/~esr/faqs/hacker-howto.html">How To Become A Hacker</a></li>
<li><a href="http://www.catb.org/~esr/faqs/smart-questions.html">How To Ask Questions The Smart Way</a></li>
<li><a href="https://uses.tech/">/uses</a> - A list of /uses pages detailing developer setups, gear, software and configs</li>
</ul>

<div id="outline-container-org6cbd3a8" class="outline-2">
<h2 id="org6cbd3a8"><span class="section-number-2">1</span> Life</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgaece545" class="outline-3">
<h3 id="orgaece545"><span class="section-number-3">1.1</span> Minimalism</h3>
</div>
<div id="outline-container-orgcac063a" class="outline-3">
<h3 id="orgcac063a"><span class="section-number-3">1.2</span> IME</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org3aa4653" class="outline-4">
<h4 id="org3aa4653"><span class="section-number-4">1.2.1</span> 双拼</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><a href="https://sspai.com/post/33019">选择输入法的哲学：兼论双拼的优缺点 - 少数派</a>
<ul class="org-ul">
<li>录入文字的过程可以简单分为两个环节：1. 大脑将思考的内容转化为可以通过键盘录入的内容（比如字形、字音）；2. 通过键盘将字形或字音录入电脑并组合为最终文字。</li>
<li><b>我们的大脑更容易把思维转化为声音而不是文字</b> ，甚至有很多人必须先把思维转化为声音然后才能进一步转化为文字：我们见过很多人在输入的时候嘴里念念有词，这就是通过声音来辅助文字呈现的一种方式，但我们从来没见过有人说话的时候，需要拿支笔边写边说。</li>
<li>双拼输入法是拼音输入法的一种，因此它继承了拼音输入法在第一环节的优势；而由于简化了复合声母和韵母，在第二环节的效率追平甚至超过了五笔输入法。</li>
</ul></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgf339dd7"></a>Practice<br>
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>强制替换电脑和手机上的输入法</li>
<li>打印键位并贴到墙上</li>
<li>使用讯飞输入法键位皮肤</li>
<li>微信聊天背景设为键位图</li>
</ul>
</div>
</li>

<li><a id="orge69ffa5"></a>Resource<br>
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li><a href="https://www.flypy.com/">小鹤双拼·小鹤音形 - 官方网站</a></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5b17d60" class="outline-4">
<h4 id="org5b17d60"><span class="section-number-4">1.2.2</span> RIME</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orgf0d2c60"></a>Squirrel<br>
<div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li><a href="https://github.com/placeless/squirrel_config">placeless/squirrel<sub>config</sub></a> - Rime 鼠须管小鹤双拼配置</li>
<li><a href="https://github.com/cnfeat/Rime">cnfeat/Rime</a> - 鼠须管 小鹤双拼 输入法配置及配色方案</li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org3f8442d" class="outline-3">
<h3 id="org3f8442d"><span class="section-number-3">1.3</span> Bypass GFW</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://www.v2ray.com/">V2Ray</a>
<ul class="org-ul">
<li><a href="https://guide.v2fly.org/advanced/wss_and_web.html">WebSocket + TLS + Web</a></li>
</ul></li>
<li><a href="https://github.com/trojan-gfw/trojan">trojan-gfw/trojan</a></li>
<li><a href="https://github.com/TheWanderingCoel/Trojan-Qt5">TheWanderingCoel/Trojan-Qt5</a> - Windows, macOS, Linux</li>
<li><a href="https://github.com/yichengchen/clashX/tree/master">ClashX</a> - macOS</li>
<li><a href="https://apps.apple.com/us/app/shadowrocket/id932747118">Shadowroket</a> - iOS</li>
<li><a href="https://github.com/Hackl0us/SS-Rule-Snippet">Hackl0us/SS-Rule-Snippet</a> - Surge / Quantumult / Shadowrocket / Surfboard / clash(X) 实用规则</li>
<li><a href="https://github.com/geekdada/surgio">geekdada/surgio</a> - Generating rules for Surge, Clash, Quantumult&#x2026; like a PRO</li>
</ul>
</div>
</div>

<div id="outline-container-org009d1f1" class="outline-3">
<h3 id="org009d1f1"><span class="section-number-3">1.4</span> Marathon</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>知乎圆桌<a href="https://www.zhihu.com/roundtable/marathon2015/">《马拉松之路》</a></li>
<li><a href="https://www.zhihu.com/question/21557037">有哪些配合马拉松训练的核心力量训练项目或计划？ - 知乎</a>
<ul class="org-ul">
<li>核心力量训练是指针对核心区域肌肉（主要是腹部、下背部和骨盆部肌群）及其深层小肌肉进行的力量、稳定、平衡等能力的训练，它不同于传统的腰腹力量训练，而是使核心区域的整体原动肌和局部稳定肌均能通过训练得到发展和提高。核心力量训练的目的就是使整个机体协调起来，确保训练者在做动作时核心肌群起到稳定躯体，传输能量的作用。</li>
</ul></li>
<li><a href="https://www.zhihu.com/question/62561329">越野跑和公路跑有哪些区别？ - 知乎</a></li>
<li><a href="http://thespiral.fm/episodes/4">Episode 004 — 当我们谈跑步时，我们谈些什么</a>
<ul class="org-ul">
<li>跑步是对现实生活的逃避，是一种解脱或者说移情。</li>
</ul></li>
<li>动画<a href="https://movie.douban.com/subject/30238385/">《强风吹拂》</a>
<ul class="org-ul">
<li><a href="http://thespiral.fm/episodes/5">Episode 005 — 纵使强风起，人生不言弃</a>
<ul class="org-ul">
<li>对一个跑者的最高赞美是什么。快吗？我觉得应该是强。</li>
<li>无论你处于什么立场、曾经有过什么样的遭遇，面对跑步这件事，所有人都得站在同一条起跑线上。不论最后是成功或失败，在这个当下，都取决于自己这幅身躯。正因为如此，才会有快乐，有痛苦，最后是无上的自由。</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org69d3a45" class="outline-3">
<h3 id="org69d3a45"><span class="section-number-3">1.5</span> Podcast</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://sspai.com/post/58577">播客届的京派与海派 - 少数派</a>
<ul class="org-ul">
<li>时隔近百年，当下的中文播客圈，听众之中流行着一个说法，将中文播客分类为「陪伴型 / 湿货」和「硬核型 / 干货」两种类型。苹果发布的 2019 年最佳中文播客榜单中，不乏「大内密谈」「日谈公园」「跟宇宙结婚」这样的「闲话类」陪伴型播客，也丰盈着「忽左忽右」「博物志」「声东击西」「不可理论」等信息度相对密集、知识点充沛的播客节目。前者往往以北京为核心，主要是北方语系；后者则以上海为中心，且基本有海外背景。</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org0f5a4ce" class="outline-4">
<h4 id="org0f5a4ce"><span class="section-number-4">1.5.1</span> App</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
泛用型播客客户端：
</p>
<ul class="org-ul">
<li><a href="https://castro.fm/">Castro</a> - iOS | Recommand</li>
<li><a href="https://overcast.fm/">Overcast</a> - iOS</li>
<li><a href="https://www.pocketcasts.com/">Pocket Casts</a> - Android &amp; iOS</li>
</ul>
</div>
</div>

<div id="outline-container-org8b43f37" class="outline-4">
<h4 id="org8b43f37"><span class="section-number-4">1.5.2</span> Explore</h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li><a href="https://letter.getpodcast.xyz/">播客 Feed 订阅</a></li>
<li><a href="https://typlog.com/podlist/">中文独立播客</a> - 发现与推荐高质量的中文独立播客</li>
</ul>

<p>
Jesse Chan (<a href="https://twitter.com/Jesoooor">@Jesoooor</a>) 言：
</p>
<blockquote>
<p>
独立 = 创作过程不受限制、影响。
</p>

<p>
这个限制和影响可能来自资本、技术、商业、受众。但你不可能找到一个一刀切的标准来定义「独立」。
</p>

<p>
小众厂牌 Spotify 独占，能叫独立音乐吗？微软独占的《Cuphead》叫独立游戏吗？
</p>

<p>
这是要从内容本身出发去判断的，真正「独立」的内容会散发出独一无二的气质。
</p>
</blockquote>
</div>
</div>
