index.org
*** Subscription
Favorites：
- [[https://teacherluke.co.uk/][Luke's English Podcast]]
- [[https://casticle.fm/][Casticle]]
  - 是一档探索并发现优质单期英文播客的中文节目。每期节目将为你推荐三期不同主题或类型的英文播客，讲述这些播客的精彩之处，整理与其相关的信息与知识。我们希望能帮助你更高效地接触英文原生内容，并享受随之而来的快乐与启发。
- [[http://rss.lizhi.fm/rss/1959617.xml][得意忘形]]
  - 是一个主张追求个体自由与探寻真理的实验计划。我们见证了第一次工业革命以来科技对人类社会的极大推动与助益，但也意识到资本主义与市场经济不可避免地催生了消费文化、剥夺了个人价值、并窃取了大众时间。带着对生命的有限性与无目的性的敬畏，我们试图为读者与听众提供更全面的觉察自我与认知世界的工具，以不断重建当下的方式穿越时间、抵达生活的本质。
- [[https://byte.coffee/][Byte.Coffee]]
  - 一家以 Engineer 视角面对世界的字节咖啡店，提供一支独立极简、健康明亮、科学主调、人文余韵的声波咖啡豆。人间指南主播 hb 曾打趣说是「科技与人文十字路口的街角咖啡店」，我觉得需要改成「科学与人文的十字路口」，特指自然科学。技术固然重要，但背后的科学是基础是理论是根基，一名科研工作者必须谨记这一点。
- [[https://czgx.fireside.fm/rss][迟早更新]]
  - 这是一档探讨科技、商业、设计和生活之间混沌关系的播客节目，也是风险基金 ONES Ventures 关于热情、趣味和好奇心的音频记录。我们希望通过这档播客，能让熟悉的事物变得新鲜，让新鲜的事物变得熟悉。
- [[http://feed.tangsuanradio.com/gadio.xml][机核网 GADIO 游戏广播]]
- [[http://web.archive.org/web/20160604093615/http://antiwave.net/][反波 Antiwave - web.archive.org]]

*** Episode
** Subscriptions
*** App
*** Web Service
*** Entertainment

* Job
** Prepare
- [[https://www.zhihu.com/question/24099873][如何得到 Google 的工作机会？ - 知乎]]
- [[https://github.com/geekcompany/ResumeSample][geekcompany/ResumeSample]] - 程序员简历模板系列
- [[https://github.com/azl397985856/fe-interview][azl397985856/fe-interview]] - 大前端面试宝典
- [[https://labuladong.gitbook.io/algo/][labuladong的算法小抄]]

*** Interview
[[https://github.com/jwasham/coding-interview-university][jwasham/coding-interview-university]]

** Resource
- [[https://github.com/greatghoul/remote-working][greatghoul/remote-working]] - 本列表只收录中国国内的资源或者对国内受众友好的国外资源

** Experience
- [[https://www.zhihu.com/question/39610449][在谷歌日本(Google Japan)工作是怎样一番体验？ - 知乎]]

* Language Learning
** English
*** Vocabulary
- [[https://www.zhihu.com/question/26814125][你是如何将词汇量提升到 2 万，甚至 3 万的？ - 知乎]]

**** 单词表选择
- [[https://www.wordfrequency.info/purchase.asp][Word frequency: based on 450 million word COCA corpus]]

*** Grammar
- 英语语法新思维初级/中级/高级教材
- [[https://book.douban.com/subject/5038844/][英语常用词疑难用法手册 - 豆瓣]]
- [[https://book.douban.com/subject/3424236/][McGraw-Hill's Essential American Idioms - 豆瓣]]

*** Listening
- [[http://elllo.org/][ELLLO - English Listening Lesson Library Online]]

*** Reading
- "Stuff White People like"
- "How to Be Black"
- "Hunger of Memory"
- "Dataclysm"
- [[https://www.procon.org/][ProCon.org - Pros and Cons of Controversial Issues]]
- [[https://www.activelylearn.com/][Actively Learn]] - 任务导向型阅读训练

*** Speaking
- "White Girl Problems" - novel
- "New Girl" - TV Series
- "Girls" - TV Series
- "Jessie" - TV Series
- "Dream School" - Netflix TV Series

* Reading
** Magazine
- [[https://aeon.co/][Aeon | a new world of ideas]]
- [[https://longform.org/][Longform]]

** Blog
- [[http://www.yinwang.org/][当然我在扯淡 - 王垠]]
- [[https://blog.imalan.cn/][无文字 | 三无计划]]
- [[https://jesor.me/][大破进击]]
- [[https://www.phodal.com/][Phodal - 狼和凤凰 | Growth Engineer]]

* Writing
* Design
- [[https://sspai.com/tag/%E8%AE%BE%E8%AE%A1][#设计 - 少数派]]

* Open Source
- [[https://opensource.guide/][Open Source Guides]]
- [[https://github.phodal.com/][GitHub 漫游指南]] by [[https://www.phodal.com/][Phodal Huang]]

* Computer Science
- [[https://github.com/ossu/computer-science][ossu/computer-science]] - Path to a free self-taught education in Computer Science
- [[https://www.bilibili.com/video/av21376839/][Crash Course Computer Science]] - 中英字幕

* Programming
- [[http://coolshell.cn/articles/4990.html][程序员技术练级攻略 - 2011年07月]]
  - [[https://exuanbo.xyz/posts/programmer/][2018 新版索引]]
- [[https://blog.knownsec.com/Knownsec_RD_Checklist/index.html][知道创宇研发技能表]] - "聪明的人，会根据每个tip自驱动扩展"

* Web
** CSS
- [[https://github.com/robsheldon/sscaffold-css][robsheldon/sscaffold-css]] - Combines css rules from normalize.css and skeleton.css
- [[https://css-tricks.com/new-year-new-job-lets-make-a-grid-powered-resume/][New Year, New Job? Let's Make a Grid-Powered Resume! | CSS-Tricks]]

** Nginx Configuration
[[https://gist.github.com/fotock/9cf9afc2fd0f813828992ebc4fdaad6f][fotock/nginx.conf]] - Nginx SSL 安全配置最佳实践

#+begin_src shell
# 生成 dhparam.pem 文件, 在命令行执行任一方法:

# 方法1: 很慢
openssl dhparam -out /etc/nginx/ssl/dhparam.pem 2048

# 方法2: 较快
# 与方法1无明显区别. 2048位也足够用, 4096更强
openssl dhparam -dsaparam -out /etc/nginx/ssl/dhparam.pem 4096
#+end_src

