index.html

<div id="outline-container-org8d0de1a" class="outline-4">
<h4 id="org8d0de1a"><span class="section-number-4">1.5.3</span> Subscription</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Favorites：
</p>
<ul class="org-ul">
<li><a href="https://teacherluke.co.uk/">Luke's English Podcast</a></li>
<li><a href="https://casticle.fm/">Casticle</a>
<ul class="org-ul">
<li>是一档探索并发现优质单期英文播客的中文节目。每期节目将为你推荐三期不同主题或类型的英文播客，讲述这些播客的精彩之处，整理与其相关的信息与知识。我们希望能帮助你更高效地接触英文原生内容，并享受随之而来的快乐与启发。</li>
</ul></li>
<li><a href="http://rss.lizhi.fm/rss/1959617.xml">得意忘形</a>
<ul class="org-ul">
<li>是一个主张追求个体自由与探寻真理的实验计划。我们见证了第一次工业革命以来科技对人类社会的极大推动与助益，但也意识到资本主义与市场经济不可避免地催生了消费文化、剥夺了个人价值、并窃取了大众时间。带着对生命的有限性与无目的性的敬畏，我们试图为读者与听众提供更全面的觉察自我与认知世界的工具，以不断重建当下的方式穿越时间、抵达生活的本质。</li>
</ul></li>
<li><a href="https://byte.coffee/">Byte.Coffee</a>
<ul class="org-ul">
<li>一家以 Engineer 视角面对世界的字节咖啡店，提供一支独立极简、健康明亮、科学主调、人文余韵的声波咖啡豆。人间指南主播 hb 曾打趣说是「科技与人文十字路口的街角咖啡店」，我觉得需要改成「科学与人文的十字路口」，特指自然科学。技术固然重要，但背后的科学是基础是理论是根基，一名科研工作者必须谨记这一点。</li>
</ul></li>
<li><a href="https://czgx.fireside.fm/rss">迟早更新</a>
<ul class="org-ul">
<li>这是一档探讨科技、商业、设计和生活之间混沌关系的播客节目，也是风险基金 ONES Ventures 关于热情、趣味和好奇心的音频记录。我们希望通过这档播客，能让熟悉的事物变得新鲜，让新鲜的事物变得熟悉。</li>
</ul></li>
<li><a href="http://feed.tangsuanradio.com/gadio.xml">机核网 GADIO 游戏广播</a></li>
<li><a href="http://web.archive.org/web/20160604093615/http://antiwave.net/">反波 Antiwave - web.archive.org</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5cb3d74" class="outline-4">
<h4 id="org5cb3d74"><span class="section-number-4">1.5.4</span> Episode</h4>
</div>
</div>
<div id="outline-container-org78894c2" class="outline-3">
<h3 id="org78894c2"><span class="section-number-3">1.6</span> Subscriptions</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orga831de8" class="outline-4">
<h4 id="orga831de8"><span class="section-number-4">1.6.1</span> App</h4>
</div>
<div id="outline-container-orgf365515" class="outline-4">
<h4 id="orgf365515"><span class="section-number-4">1.6.2</span> Web Service</h4>
</div>
<div id="outline-container-orge1cccef" class="outline-4">
<h4 id="orge1cccef"><span class="section-number-4">1.6.3</span> Entertainment</h4>
</div>
</div>
</div>

<div id="outline-container-orgf38f03f" class="outline-2">
<h2 id="orgf38f03f"><span class="section-number-2">2</span> Job</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org55fb3f7" class="outline-3">
<h3 id="org55fb3f7"><span class="section-number-3">2.1</span> Prepare</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://www.zhihu.com/question/24099873">如何得到 Google 的工作机会？ - 知乎</a></li>
<li><a href="https://github.com/geekcompany/ResumeSample">geekcompany/ResumeSample</a> - 程序员简历模板系列</li>
<li><a href="https://github.com/azl397985856/fe-interview">azl397985856/fe-interview</a> - 大前端面试宝典</li>
<li><a href="https://labuladong.gitbook.io/algo/">labuladong的算法小抄</a></li>
</ul>
</div>

<div id="outline-container-org55b0e5d" class="outline-4">
<h4 id="org55b0e5d"><span class="section-number-4">2.1.1</span> Interview</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
<a href="https://github.com/jwasham/coding-interview-university">jwasham/coding-interview-university</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgf23ea96" class="outline-3">
<h3 id="orgf23ea96"><span class="section-number-3">2.2</span> Resource</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://github.com/greatghoul/remote-working">greatghoul/remote-working</a> - 本列表只收录中国国内的资源或者对国内受众友好的国外资源</li>
</ul>
</div>
</div>

<div id="outline-container-orgd559e11" class="outline-3">
<h3 id="orgd559e11"><span class="section-number-3">2.3</span> Experience</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://www.zhihu.com/question/39610449">在谷歌日本(Google Japan)工作是怎样一番体验？ - 知乎</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5583442" class="outline-2">
<h2 id="org5583442"><span class="section-number-2">3</span> Language Learning</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7f73a7a" class="outline-3">
<h3 id="org7f73a7a"><span class="section-number-3">3.1</span> English</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org126afff" class="outline-4">
<h4 id="org126afff"><span class="section-number-4">3.1.1</span> Vocabulary</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li><a href="https://www.zhihu.com/question/26814125">你是如何将词汇量提升到 2 万，甚至 3 万的？ - 知乎</a></li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org4bf80f8"></a>单词表选择<br>
<div class="outline-text-5" id="text-3-1-1-1">
<ul class="org-ul">
<li><a href="https://www.wordfrequency.info/purchase.asp">Word frequency: based on 450 million word COCA corpus</a></li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2400ee6" class="outline-4">
<h4 id="org2400ee6"><span class="section-number-4">3.1.2</span> Grammar</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>英语语法新思维初级/中级/高级教材</li>
<li><a href="https://book.douban.com/subject/5038844/">英语常用词疑难用法手册 - 豆瓣</a></li>
<li><a href="https://book.douban.com/subject/3424236/">McGraw-Hill's Essential American Idioms - 豆瓣</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3335d3f" class="outline-4">
<h4 id="org3335d3f"><span class="section-number-4">3.1.3</span> Listening</h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li><a href="http://elllo.org/">ELLLO - English Listening Lesson Library Online</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge1b12d2" class="outline-4">
<h4 id="orge1b12d2"><span class="section-number-4">3.1.4</span> Reading</h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>"Stuff White People like"</li>
<li>"How to Be Black"</li>
<li>"Hunger of Memory"</li>
<li>"Dataclysm"</li>
<li><a href="https://www.procon.org/">ProCon.org - Pros and Cons of Controversial Issues</a></li>
<li><a href="https://www.activelylearn.com/">Actively Learn</a> - 任务导向型阅读训练</li>
</ul>
</div>
</div>

<div id="outline-container-org2c93afc" class="outline-4">
<h4 id="org2c93afc"><span class="section-number-4">3.1.5</span> Speaking</h4>
<div class="outline-text-4" id="text-3-1-5">
<ul class="org-ul">
<li>"White Girl Problems" - novel</li>
<li>"New Girl" - TV Series</li>
<li>"Girls" - TV Series</li>
<li>"Jessie" - TV Series</li>
<li>"Dream School" - Netflix TV Series</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd811ab3" class="outline-2">
<h2 id="orgd811ab3"><span class="section-number-2">4</span> Reading</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc6307f0" class="outline-3">
<h3 id="orgc6307f0"><span class="section-number-3">4.1</span> Magazine</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://aeon.co/">Aeon | a new world of ideas</a></li>
<li><a href="https://longform.org/">Longform</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgab0eb3c" class="outline-3">
<h3 id="orgab0eb3c"><span class="section-number-3">4.2</span> Blog</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><a href="http://www.yinwang.org/">当然我在扯淡 - 王垠</a></li>
<li><a href="https://blog.imalan.cn/">无文字 | 三无计划</a></li>
<li><a href="https://jesor.me/">大破进击</a></li>
<li><a href="https://www.phodal.com/">Phodal - 狼和凤凰 | Growth Engineer</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org224f2a0" class="outline-2">
<h2 id="org224f2a0"><span class="section-number-2">5</span> Writing</h2>
</div>
<div id="outline-container-org5d1ce7a" class="outline-2">
<h2 id="org5d1ce7a"><span class="section-number-2">6</span> Design</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://sspai.com/tag/%E8%AE%BE%E8%AE%A1">#设计 - 少数派</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1927b58" class="outline-2">
<h2 id="org1927b58"><span class="section-number-2">7</span> Open Source</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="https://opensource.guide/">Open Source Guides</a></li>
<li><a href="https://github.phodal.com/">GitHub 漫游指南</a> by <a href="https://www.phodal.com/">Phodal Huang</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7d57da3" class="outline-2">
<h2 id="org7d57da3"><span class="section-number-2">8</span> Computer Science</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://github.com/ossu/computer-science">ossu/computer-science</a> - Path to a free self-taught education in Computer Science</li>
<li><a href="https://www.bilibili.com/video/av21376839/">Crash Course Computer Science</a> - 中英字幕</li>
</ul>
</div>
</div>

<div id="outline-container-orgf22d7a7" class="outline-2">
<h2 id="orgf22d7a7"><span class="section-number-2">9</span> Programming</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="http://coolshell.cn/articles/4990.html">程序员技术练级攻略 - 2011年07月</a>
<ul class="org-ul">
<li><a href="https://exuanbo.xyz/posts/programmer/">2018 新版索引</a></li>
</ul></li>
<li><a href="https://blog.knownsec.com/Knownsec_RD_Checklist/index.html">知道创宇研发技能表</a> - "聪明的人，会根据每个tip自驱动扩展"</li>
</ul>
</div>
</div>

<div id="outline-container-orga4db964" class="outline-2">
<h2 id="orga4db964"><span class="section-number-2">10</span> Web</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org59b2a47" class="outline-3">
<h3 id="org59b2a47"><span class="section-number-3">10.1</span> CSS</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li><a href="https://github.com/robsheldon/sscaffold-css">robsheldon/sscaffold-css</a> - Combines css rules from normalize.css and skeleton.css</li>
<li><a href="https://css-tricks.com/new-year-new-job-lets-make-a-grid-powered-resume/">New Year, New Job? Let's Make a Grid-Powered Resume! | CSS-Tricks</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7a6947c" class="outline-3">
<h3 id="org7a6947c"><span class="section-number-3">10.2</span> Nginx Configuration</h3>
<div class="outline-text-3" id="text-10-2">
<p>
<a href="https://gist.github.com/fotock/9cf9afc2fd0f813828992ebc4fdaad6f">fotock/nginx.conf</a> - Nginx SSL 安全配置最佳实践
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#29983;&#25104; dhparam.pem &#25991;&#20214;, &#22312;&#21629;&#20196;&#34892;&#25191;&#34892;&#20219;&#19968;&#26041;&#27861;:</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26041;&#27861;1: &#24456;&#24930;</span>
openssl dhparam -out /etc/nginx/ssl/dhparam.pem <span style="color: #4e3163;">2048</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26041;&#27861;2: &#36739;&#24555;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19982;&#26041;&#27861;1&#26080;&#26126;&#26174;&#21306;&#21035;. 2048&#20301;&#20063;&#36275;&#22815;&#29992;, 4096&#26356;&#24378;</span>
openssl dhparam -dsaparam -out /etc/nginx/ssl/dhparam.pem <span style="color: #4e3163;">4096</span>
</pre>
</div>
</div>
