index.html

<div id="outline-container-orge4a3f80" class="outline-4">
<h4 id="orge4a3f80"><span class="section-number-4">10.2.1</span> nginx.conf</h4>
<div class="outline-text-4" id="text-10-2-1">
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#38405;&#35835;&#26356;&#22810; http://tautt.com/best-nginx-configuration-for-security/</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19981;&#21457;&#36865;Nginx&#29256;&#26412;&#21495;</span>
server_tokens off;

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19981;&#20801;&#35768;&#27983;&#35272;&#22120;&#22312;frame&#25110;iframe&#20013;&#26174;&#31034;&#39029;&#38754;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36991;&#20813; &#28857;&#20987;&#21163;&#25345;(clickjacking) http://en.wikipedia.org/wiki/Clickjacking</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#22914;&#26524;&#38656;&#35201;&#20801;&#35768; [i]frames, &#20320;&#21487;&#20197;&#29992; SAMEORIGIN &#25110;&#32773;&#29992;ALLOW-FROM uri &#35774;&#32622;&#21333;&#20010;uri</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://developer.mozilla.org/en-US/docs/HTTP/X-Frame-Options</span>
add_header X-Frame-Options SAMEORIGIN;

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26381;&#21153;&#29992;&#25143;&#25552;&#20379;&#30340;&#20869;&#23481;&#26102;, &#21253;&#21547; X-Content-Type-Options: nosniff &#22836;&#36873;&#39033;&#65292;&#37197;&#21512; Content-Type: &#22836;&#36873;&#39033;,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26469;&#31105;&#29992;&#26576;&#20123;&#27983;&#35272;&#22120;&#30340; content-type &#25506;&#27979;.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://www.owasp.org/index.php/List_of_useful_HTTP_headers</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24403;&#21069;&#25903;&#25345; IE &gt; 8 http://blogs.msdn.com/b/ie/archive/2008/09/02/ie8-security-part-vi-beta-2-update.aspx</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://msdn.microsoft.com/en-us/library/ie/gg622941(v=vs.85).aspx</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#28779;&#29392; '&#19981;&#20037;'&#25903;&#25345; https://bugzilla.mozilla.org/show_bug.cgi?id=471020</span>
add_header X-Content-Type-Options nosniff;

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992;&#22823;&#37096;&#20998;&#29616;&#20195;&#27983;&#35272;&#22120;&#20869;&#32622;&#30340; the Cross-site scripting (XSS) &#36807;&#28388;.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36890;&#24120;&#32570;&#30465;&#24773;&#20917;&#19979;&#24050;&#32463;&#21551;&#29992;, &#25152;&#20197;&#26412;&#36873;&#39033;&#20026;&#20026;&#26412;&#32593;&#31449;&#37325;&#21551;&#36807;&#28388;&#22120;&#65292;&#20197;&#38450;&#20854;&#34987;&#29992;&#25143;&#31105;&#29992;.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://www.owasp.org/index.php/List_of_useful_HTTP_headers</span>
add_header X-XSS-Protection <span style="color: #2d9574;">"1; mode=block"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992; Content Security Policy (CSP) (&#21644;&#25903;&#25345;&#23427;&#30340;&#27983;&#35272;&#22120;(http://caniuse.com/#feat=contentsecuritypolicy)&#21518;,</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20320;&#21487;&#20197;&#21578;&#35785;&#27983;&#35272;&#22120;&#23427;&#20165;&#33021;&#20174;&#20320;&#26126;&#30830;&#20801;&#35768;&#30340;&#22495;&#21517;&#19979;&#36733;&#20869;&#23481;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://www.html5rocks.com/en/tutorials/security/content-security-policy/</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://www.owasp.org/index.php/Content_Security_Policy</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20462;&#25913;&#24212;&#29992;&#20195;&#30721;, &#36890;&#36807;&#31105;&#29992;css&#21644;js&#30340; 'unsafe-inline' 'unsafe-eval' &#25351;&#26631;&#25552;&#39640;&#23433;&#20840;&#24615;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">(&#23545;&#20869;&#32852;css&#21644;js&#21516;&#26679;&#36866;&#29992;).</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26356;&#22810;: http://www.html5rocks.com/en/tutorials/security/content-security-policy/#inline-code-considered-harmful</span>
add_header Content-Security-Policy <span style="color: #2d9574;">"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval' https://ssl.google-analytics.com https://assets.zendesk.com https://connect.facebook.net; img-src 'self' https://ssl.google-analytics.com https://s-static.ak.facebook.com https://assets.zendesk.com; style-src 'self' 'unsafe-inline' https://fonts.googleapis.com https://assets.zendesk.com; font-src 'self' https://themes.googleusercontent.com; frame-src https://assets.zendesk.com https://www.facebook.com https://s-static.ak.facebook.com https://tautt.zendesk.com; object-src 'none'"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#23558;&#25152;&#26377; http &#36339;&#36716;&#33267; https</span>
<span style="color: #ba2f59; font-weight: bold;">server</span> {
  listen 80 default_server;
  listen [::]:80 default_server;
  server_name .forgott.com;
  return 301 https://$host$request_uri;
}

<span style="color: #ba2f59; font-weight: bold;">server</span> {
  listen 443 ssl http2;
  listen [::]:443 ssl http2;
  server_name .forgott.com;

  ssl_certificate /etc/nginx/ssl/star_forgott_com.crt;
  ssl_certificate_key /etc/nginx/ssl/star_forgott_com.key;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992; session resumption &#25552;&#39640;HTTPS&#24615;&#33021;</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://vincent.bernat.im/en/blog/2011-ssl-session-reuse-rfc5077.html</span>
  ssl_session_cache shared:SSL:50m;
  ssl_session_timeout 1d;
  ssl_session_tickets off;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">DHE&#23494;&#30721;&#22120;&#30340;Diffie-Hellman&#21442;&#25968;, &#25512;&#33616; 2048 &#20301;</span>
  ssl_dhparam /etc/nginx/ssl/dhparam.pem;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992;&#26381;&#21153;&#22120;&#31471;&#20445;&#25252;, &#38450;&#27490; BEAST &#25915;&#20987;</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://blog.ivanristic.com/2013/09/is-beast-still-a-threat.html</span>
  ssl_prefer_server_ciphers on;
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#31105;&#29992; SSLv3(enabled by default since nginx 0.8.19) since it's less secure then TLS http://en.wikipedia.org/wiki/Secure_Sockets_Layer#SSL_3.0</span>
  ssl_protocols TLSv1 TLSv1.1 TLSv1.2;
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">ciphers chosen for forward secrecy and compatibility</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://blog.ivanristic.com/2013/08/configuring-apache-nginx-and-openssl-for-forward-secrecy.html</span>
  ssl_ciphers <span style="color: #2d9574;">'ECDHE-ECDSA-CHACHA20-POLY1305:ECDHE-RSA-CHACHA20-POLY1305:ECDHE-ECDSA-AES128-GCM-SHA256:ECDHE-RSA-AES128-GCM-SHA256:ECDHE-ECDSA-AES256-GCM-SHA384:ECDHE-RSA-AES256-GCM-SHA384:DHE-RSA-AES128-GCM-SHA256:DHE-RSA-AES256-GCM-SHA384:ECDHE-ECDSA-AES128-SHA256:ECDHE-RSA-AES128-SHA256:ECDHE-ECDSA-AES128-SHA:ECDHE-RSA-AES256-SHA384:ECDHE-RSA-AES128-SHA:ECDHE-ECDSA-AES256-SHA384:ECDHE-ECDSA-AES256-SHA:ECDHE-RSA-AES256-SHA:DHE-RSA-AES128-SHA256:DHE-RSA-AES128-SHA:DHE-RSA-AES256-SHA256:DHE-RSA-AES256-SHA:ECDHE-ECDSA-DES-CBC3-SHA:ECDHE-RSA-DES-CBC3-SHA:EDH-RSA-DES-CBC3-SHA:AES128-GCM-SHA256:AES256-GCM-SHA384:AES128-SHA256:AES256-SHA256:AES128-SHA:AES256-SHA:DES-CBC3-SHA:!DSS'</span>;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992; ocsp stapling (&#32593;&#31449;&#21487;&#20197;&#20197;&#38544;&#31169;&#20445;&#25252;&#12289;&#21487;&#25193;&#23637;&#30340;&#26041;&#24335;&#21521;&#35775;&#23458;&#20256;&#36798;&#35777;&#20070;&#21514;&#38144;&#20449;&#24687;&#30340;&#26426;&#21046;)</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">http://blog.mozilla.org/security/2013/07/29/ocsp-stapling-in-firefox/</span>
  resolver 8.8.8.8 8.8.4.4;
  ssl_stapling on;
  ssl_stapling_verify on;
  ssl_trusted_certificate /etc/nginx/ssl/star_forgott_com.crt;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21551;&#29992; HSTS(HTTP Strict Transport Security) https://developer.mozilla.org/en-US/docs/Security/HTTP_Strict_Transport_Security</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36991;&#20813; ssl stripping https://en.wikipedia.org/wiki/SSL_stripping#SSL_stripping</span>
  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25110; https://hstspreload.org/</span>
  add_header Strict-Transport-Security <span style="color: #2d9574;">"max-age=31536000; includeSubdomains; preload"</span>;

  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">... &#20854;&#20182;&#37197;&#32622;</span>
}
</pre>
</div>
</div>
</div>
</div>
