index.org
** Resource
- [[https://simpleicons.org/][Simple Icons]] - Free SVG icons for popular brands
- [[https://github.com/refactoringui/heroicons][refactoringui/heroicons]] - A set of free MIT-licensed high-quality SVG icons for UI development

* iOS
* Game
** Development
- [[https://indienova.com/groups/14][我们都爱像素风 - Indienova 小组]]

* Git
** Pull-Request steps
[[http://akrabat.com/the-beginners-guide-to-contributing-to-a-github-project/][The beginner's guide to contributing to a GitHub project]]
1. Fork the project and clone locally
2. ~git remote add upstream git@github.com:xxx/xxx.git~
3. ~git checkout -b newBranch~
4. Do something and commit
5. ~git pull --rebase upstream master~
6. ~git push origin~

** Github Pages
- [[https://stackoverflow.com/questions/11577147/how-to-fix-http-404-on-github-pages][How to fix HTTP 404 on Github Pages?]] If you don't use Jekyll, the workaround is to place a file named ~.nojekyll~ in the root directory.

