index.html

<div id="outline-container-org7560ba5" class="outline-3">
<h3 id="org7560ba5"><span class="section-number-3">10.3</span> Resource</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li><a href="https://simpleicons.org/">Simple Icons</a> - Free SVG icons for popular brands</li>
<li><a href="https://github.com/refactoringui/heroicons">refactoringui/heroicons</a> - A set of free MIT-licensed high-quality SVG icons for UI development</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org35ac533" class="outline-2">
<h2 id="org35ac533"><span class="section-number-2">11</span> iOS</h2>
</div>
<div id="outline-container-org25f1b9c" class="outline-2">
<h2 id="org25f1b9c"><span class="section-number-2">12</span> Game</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org0b297ca" class="outline-3">
<h3 id="org0b297ca"><span class="section-number-3">12.1</span> Development</h3>
<div class="outline-text-3" id="text-12-1">
<ul class="org-ul">
<li><a href="https://indienova.com/groups/14">我们都爱像素风 - Indienova 小组</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd3add23" class="outline-2">
<h2 id="orgd3add23"><span class="section-number-2">13</span> Git</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgfa16953" class="outline-3">
<h3 id="orgfa16953"><span class="section-number-3">13.1</span> Pull-Request steps</h3>
<div class="outline-text-3" id="text-13-1">
<p>
<a href="http://akrabat.com/the-beginners-guide-to-contributing-to-a-github-project/">The beginner's guide to contributing to a GitHub project</a>
</p>
<ol class="org-ol">
<li>Fork the project and clone locally</li>
<li><code>git remote add upstream git@github.com:xxx/xxx.git</code></li>
<li><code>git checkout -b newBranch</code></li>
<li>Do something and commit</li>
<li><code>git pull --rebase upstream master</code></li>
<li><code>git push origin</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgcfef305" class="outline-3">
<h3 id="orgcfef305"><span class="section-number-3">13.2</span> Github Pages</h3>
<div class="outline-text-3" id="text-13-2">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/11577147/how-to-fix-http-404-on-github-pages">How to fix HTTP 404 on Github Pages?</a> If you don't use Jekyll, the workaround is to place a file named <code>.nojekyll</code> in the root directory.</li>
</ul>
</div>
</div>
