index.html

<div id="outline-container-orgb85c579" class="outline-3">
<h3 id="orgb85c579"><span class="section-number-3">13.3</span> Command</h3>
<div class="outline-text-3" id="text-13-3">
<div class="org-src-container">
<pre class="src src-shell">git init  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#22312;&#24403;&#21069;&#30446;&#24405;&#26032;&#24314;&#19968;&#20010; Git &#20195;&#30721;&#24211;</span>
git clone <span style="color: #3a81c3;">[</span>url<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19979;&#36733;&#19968;&#20010;&#39033;&#30446;&#21644;&#23427;&#30340;&#25972;&#20010;&#20195;&#30721;&#21382;&#21490;</span>
git config --list <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#24403;&#21069;&#30340; Git &#37197;&#32622;</span>
git config -e <span style="color: #3a81c3;">[</span>--global<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#32534;&#36753; Git &#37197;&#32622;&#25991;&#20214;</span>
git add  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#28155;&#21152;&#25351;&#23450;&#25991;&#20214;&#21040;&#26242;&#23384;&#21306;</span>
git rm   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21024;&#38500;&#24037;&#20316;&#21306;&#25991;&#20214;&#65292;&#24182;&#19988;&#23558;&#36825;&#27425;&#21024;&#38500;&#25918;&#20837;&#26242;&#23384;&#21306;</span>
git commit -m <span style="color: #3a81c3;">[</span>message<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25552;&#20132;&#26242;&#23384;&#21306;&#21040;&#20179;&#24211;&#21306;</span>
git commit -a <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25552;&#20132;&#24037;&#20316;&#21306;&#33258;&#19978;&#27425; commit &#20043;&#21518;&#30340;&#21464;&#21270;&#65292;&#30452;&#25509;&#21040;&#20179;&#24211;&#21306;</span>
git commit --amend -m <span style="color: #3a81c3;">[</span>message<span style="color: #3a81c3;">]</span>   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20351;&#29992;&#19968;&#27425;&#26032;&#30340; commit&#65292;&#26367;&#20195;&#19978;&#19968;&#27425;&#25552;&#20132; &#22914;&#26524;&#20195;&#30721;&#27809;&#26377;&#20219;&#20309;&#26032;&#21464;&#21270;&#65292;&#21017;&#29992;&#26469;&#25913;&#20889;&#19978;&#19968;&#27425; commit &#30340;&#25552;&#20132;&#20449;&#24687;</span>
git commit --amend <span style="color: #3a81c3;">[</span>file1<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>file2<span style="color: #3a81c3;">]</span> ...  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#20570;&#19978;&#19968;&#27425; commit&#65292;&#24182;&#21253;&#25324;&#25351;&#23450;&#25991;&#20214;&#30340;&#26032;&#21464;&#21270;</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20998;&#25903;&#30456;&#20851;</span>
git branch  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21015;&#20986;&#25152;&#26377;&#26412;&#22320;&#20998;&#25903;</span>
git branch -r  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21015;&#20986;&#25152;&#26377;&#36828;&#31243;&#20998;&#25903;</span>
git branch <span style="color: #3a81c3;">[</span>branch-name<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010;&#20998;&#25903;&#65292;&#20294;&#20381;&#28982;&#20572;&#30041;&#22312;&#24403;&#21069;&#20998;&#25903;</span>
git checkout <span style="color: #3a81c3;">[</span>branch-name<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20999;&#25442;&#21040;&#25351;&#23450;&#20998;&#25903;&#65292;&#24182;&#26356;&#26032;&#24037;&#20316;&#21306;</span>
git checkout -b <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010;&#20998;&#25903;&#65292;&#24182;&#20999;&#25442;&#21040;&#35813;&#20998;&#25903;</span>
git branch <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010;&#20998;&#25903;&#65292;&#25351;&#21521;&#25351;&#23450; commit</span>
git checkout -b <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>tag<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010;&#20998;&#25903;&#65292;&#25351;&#21521;&#26576;&#20010; tag</span>
git branch --track <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>remote-branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010;&#20998;&#25903;&#65292;&#19982;&#25351;&#23450;&#30340;&#36828;&#31243;&#20998;&#25903;&#24314;&#31435;&#36861;&#36394;&#20851;&#31995;</span>
git branch --set-upstream <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>remote-branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24314;&#31435;&#36861;&#36394;&#20851;&#31995;&#65292;&#22312;&#29616;&#26377;&#20998;&#25903;&#19982;&#25351;&#23450;&#30340;&#36828;&#31243;&#20998;&#25903;&#20043;&#38388;</span>
git merge <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21512;&#24182;&#25351;&#23450;&#20998;&#25903;&#21040;&#24403;&#21069;&#20998;&#25903;</span>
git cherry-pick <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36873;&#25321;&#19968;&#20010; commit&#65292;&#21512;&#24182;&#36827;&#24403;&#21069;&#20998;&#25903;</span>
git branch -d <span style="color: #3a81c3;">[</span>branch-name<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21024;&#38500;&#20998;&#25903;</span>
git push origin --delete <span style="color: #3a81c3;">[</span>branch-name<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21024;&#38500;&#36828;&#31243;&#20998;&#25903;</span>
git branch -dr <span style="color: #3a81c3;">[</span>remote/branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21024;&#38500;&#36828;&#31243;&#20998;&#25903;</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26631;&#31614;</span>
git tag  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21015;&#20986;&#25152;&#26377; tag</span>
git tag <span style="color: #3a81c3;">[</span>tag<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010; tag &#22312;&#24403;&#21069; commit</span>
git tag <span style="color: #3a81c3;">[</span>tag<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010; tag &#22312;&#25351;&#23450; commit</span>
git show <span style="color: #3a81c3;">[</span>tag<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26597;&#30475; tag &#20449;&#24687;</span>
git push <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>tag<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25552;&#20132;&#25351;&#23450; tag</span>
git push <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> --tags   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25552;&#20132;&#25152;&#26377; tag</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26597;&#30475;</span>
git status <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26377;&#21464;&#26356;&#30340;&#25991;&#20214;</span>
git log <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#24403;&#21069;&#20998;&#25903;&#30340;&#29256;&#26412;&#21382;&#21490;</span>
git log --stat <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034; commit &#21382;&#21490;&#65292;&#20197;&#21450;&#27599;&#27425; commit &#21457;&#29983;&#21464;&#26356;&#30340;&#25991;&#20214;</span>
git log --follow <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26576;&#20010;&#25991;&#20214;&#30340;&#29256;&#26412;&#21382;&#21490;&#65292;&#21253;&#25324;&#25991;&#20214;&#25913;&#21517;</span>
git log -p <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#25351;&#23450;&#25991;&#20214;&#30456;&#20851;&#30340;&#27599;&#19968;&#27425; diff</span>
git blame <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#25351;&#23450;&#25991;&#20214;&#26159;&#20160;&#20040;&#20154;&#22312;&#20160;&#20040;&#26102;&#38388;&#20462;&#25913;&#36807;</span>
git diff <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26242;&#23384;&#21306;&#21644;&#24037;&#20316;&#21306;&#30340;&#24046;&#24322;</span>
git diff --cached <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26242;&#23384;&#21306;&#21644;&#19978;&#19968;&#20010; commit &#30340;&#24046;&#24322;</span>
git diff HEAD <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#24037;&#20316;&#21306;&#19982;&#24403;&#21069;&#20998;&#25903;&#26368;&#26032; commit &#20043;&#38388;&#30340;&#24046;&#24322;</span>
git diff <span style="color: #3a81c3;">[</span>first-branch<span style="color: #3a81c3;">]</span>...<span style="color: #3a81c3;">[</span>second-branch<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#20004;&#27425;&#25552;&#20132;&#20043;&#38388;&#30340;&#24046;&#24322;</span>
git show <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26576;&#27425;&#25552;&#20132;&#30340;&#20803;&#25968;&#25454;&#21644;&#20869;&#23481;&#21464;&#21270;</span>
git show --name-only <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26576;&#27425;&#25552;&#20132;&#21457;&#29983;&#21464;&#21270;&#30340;&#25991;&#20214;</span>
git show <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span>:<span style="color: #3a81c3;">[</span>filename<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26576;&#27425;&#25552;&#20132;&#26102;&#65292;&#26576;&#20010;&#25991;&#20214;&#30340;&#20869;&#23481;</span>
git reflog <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#24403;&#21069;&#20998;&#25903;&#30340;&#26368;&#36817;&#20960;&#27425;&#25552;&#20132;</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#36828;&#31243;</span>
git fetch <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19979;&#36733;&#36828;&#31243;&#20179;&#24211;&#30340;&#25152;&#26377;&#21464;&#21160;</span>
git remote -v  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#25152;&#26377;&#36828;&#31243;&#20179;&#24211;</span>
git remote show <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26174;&#31034;&#26576;&#20010;&#36828;&#31243;&#20179;&#24211;&#30340;&#20449;&#24687;</span>
git remote add <span style="color: #3a81c3;">[</span>shortname<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>url<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#22686;&#21152;&#19968;&#20010;&#26032;&#30340;&#36828;&#31243;&#20179;&#24211;&#65292;&#24182;&#21629;&#21517;</span>
git pull <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#21462;&#22238;&#36828;&#31243;&#20179;&#24211;&#30340;&#21464;&#21270;&#65292;&#24182;&#19982;&#26412;&#22320;&#20998;&#25903;&#21512;&#24182;</span>
git push <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>branch<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#19978;&#20256;&#26412;&#22320;&#25351;&#23450;&#20998;&#25903;&#21040;&#36828;&#31243;&#20179;&#24211;</span>
git push <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> --force <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24378;&#34892;&#25512;&#36865;&#24403;&#21069;&#20998;&#25903;&#21040;&#36828;&#31243;&#20179;&#24211;&#65292;&#21363;&#20351;&#26377;&#20914;&#31361;</span>
git push <span style="color: #3a81c3;">[</span>remote<span style="color: #3a81c3;">]</span> --all <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25512;&#36865;&#25152;&#26377;&#20998;&#25903;&#21040;&#36828;&#31243;&#20179;&#24211;</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#25764;&#38144;</span>
git checkout <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24674;&#22797;&#26242;&#23384;&#21306;&#30340;&#25351;&#23450;&#25991;&#20214;&#21040;&#24037;&#20316;&#21306;</span>
git checkout <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24674;&#22797;&#26576;&#20010; commit &#30340;&#25351;&#23450;&#25991;&#20214;&#21040;&#24037;&#20316;&#21306;</span>
git checkout . <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#24674;&#22797;&#19978;&#19968;&#20010; commit &#30340;&#25152;&#26377;&#25991;&#20214;&#21040;&#24037;&#20316;&#21306;</span>
git reset <span style="color: #3a81c3;">[</span>file<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#32622;&#26242;&#23384;&#21306;&#30340;&#25351;&#23450;&#25991;&#20214;&#65292;&#19982;&#19978;&#19968;&#27425; commit &#20445;&#25345;&#19968;&#33268;&#65292;&#20294;&#24037;&#20316;&#21306;&#19981;&#21464;</span>
git reset --hard <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#32622;&#26242;&#23384;&#21306;&#19982;&#24037;&#20316;&#21306;&#65292;&#19982;&#19978;&#19968;&#27425; commit &#20445;&#25345;&#19968;&#33268;</span>
git reset <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#32622;&#24403;&#21069;&#20998;&#25903;&#30340;&#25351;&#38024;&#20026;&#25351;&#23450; commit&#65292;&#21516;&#26102;&#37325;&#32622;&#26242;&#23384;&#21306;&#65292;&#20294;&#24037;&#20316;&#21306;&#19981;&#21464;</span>
git reset --hard <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#32622;&#24403;&#21069;&#20998;&#25903;&#30340; HEAD &#20026;&#25351;&#23450; commit&#65292;&#21516;&#26102;&#37325;&#32622;&#26242;&#23384;&#21306;&#21644;&#24037;&#20316;&#21306;&#65292;&#19982;&#25351;&#23450; commit &#19968;&#33268;</span>
git reset --keep <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#37325;&#32622;&#24403;&#21069; HEAD &#20026;&#25351;&#23450; commit&#65292;&#20294;&#20445;&#25345;&#26242;&#23384;&#21306;&#21644;&#24037;&#20316;&#21306;&#19981;&#21464;</span>
git revert <span style="color: #3a81c3;">[</span>commit<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#26032;&#24314;&#19968;&#20010; commit&#65292;&#29992;&#26469;&#25764;&#38144;&#25351;&#23450; commit&#65292;&#21518;&#32773;&#30340;&#25152;&#26377;&#21464;&#21270;&#37117;&#23558;&#34987;&#21069;&#32773;&#25269;&#28040;&#65292;&#24182;&#19988;&#24212;&#29992;&#21040;&#24403;&#21069;&#20998;&#25903;</span>
</pre>
</div>
</div>
</div>
</div>
