index.org
* Text Editor
** Emacs
- [[https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org][mastering-emacs-in-one-year-guide/guide-zh.org at master · redguardtoo/mastering-emacs-in-one-year-guide]]
- [[http://planet.emacsen.org/][Planet Emacsen]]

** Spacemacs
[[https://github.com/syl20bnr/spacemacs][spacemacs]] 是一款社区维护的 Emacs 配置，结合了 vim 和 Emacs 两者的优点。

*** Dotfile Configuration
A dotdirectory ~~/.spacemacs.d/~ can be used instead of a dotfile. If you want to use this option, move ~~/.spacemacs~ to ~~/.spacemacs.d/init.el~.

参考 [[https://github.com/zilongshanren/spacemacs-private][子龙山人的个人配置]] 和 GeekPlux 的 [[https://github.com/geekplux/dotfiles][dotfiles]]

*** Tips
- [[https://github.com/syl20bnr/spacemacs/issues/3920][Environment variable warnings #3920]] - Put ~(setq exec-path-from-shell-arguments '("-l"))~ in your ~dotspacemacs/user-init~

* Org Mode
- [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]]
- [[https://orgmode.org/worg/index.html][Hello Worg, the Org-Mode Community!]]
- [[https://github.com/fniessen/refcard-org-mode][fniessen/refcard-org-mode]] - Org mode syntax
- [[https://beorgapp.com/][beorg]] - iOS | Recommand
- [[http://mobileorg.github.io/][Mobile Org]] - iOS | Open Source

#+begin_src emacs-lisp
(defun dotspacemacs/user-config ()
  (with-eval-after-load 'org
    (setq org-startup-indented t)
    (setq org-html-doctype "html5")
    ))
#+end_src

[[https://github.com/gongzhitaao/orgcss][gongzhitaao/orgcss]]

When exported to HTML, there are three options for code highlighting, controlled by the variable ~org-html-htmlize-output-type~.

1. ~(setq org-html-htmlize-output-type 'inline-css)~

    This is the default setting. It highlights the code according to the current Emacs theme you are using. It directly applies color to the code with inline styles, e.g., ~<span style="color: 0x000000">int</span>~.

    The problem is that the highlight theme depends on the Emacs theme. If you use a dark theme in your Emacs but a light theme (usually we like light themed web pages) web pages, the exported code are hardly illegible due to the light font color, or vice versa.

2. ~(setq org-html-htmlize-output-type nil)~

    This configuration disables highlighting by ~htmlize~. You may use a third-party Javascript highlight library. I recommend [[https://highlightjs.org/][highlight.js]] if I need code highlight.

    There are two problems:

    1. The problem is that you have to rely on highlight.js support on a certain language which is occasionally missing, e.g., ~emacs-lisp~, ~org~, etc.
    2. ~highlight.js~ by default does not recognized the tags and classes exported by org mode. You need some extra Javascript code in your Org file.

3. ~(setq org-html-htmlize-output-type 'css)~

    This is similar to the first optional, instead of using inline styles, this will assign classes to each component of the code, e.g., ~<span class="org-type">int</span>~, and you could create your own stylesheet for ~.org-type~.

    To obtain a list of all supported org classes, run ~M-x org-html-htmlize-generate-css~.  This will create a buffer containing all the available org style class names in the current Emacs session.

* LaTeX
* OS
** Linux
** MacOS
- [[https://github.com/jaywcjlove/awesome-mac][Awesome Mac]]
- [[https://github.com/serhii-londar/open-source-mac-os-apps][Awesome macOS open source applications]]
- [[https://github.com/robbyrussell/oh-my-zsh][oh-my-zsh]]
- [[http://brew.sh/][Homebrew]]
  - [[https://github.com/phinze/homebrew-cask][homebrew-cask]]
  - ~brew leavese~ Show installed formulae that are not dependencies of another installed formula
  - [[https://github.com/beeftornado/homebrew-rmtree][beeftornado/homebrew-rmtree]] - Remove a formula and its unused dependencies
- [[https://github.com/gnachman/iTerm2][iTerm2]]
- [[http://www.alfredapp.com/][Alfred]]
  - [[http://www.alfredworkflow.com/][alfredworkflow]]

*** Setup
- [[http://sourabhbajaj.com/mac-setup/index.html][Mac OS X Setup Guide]]
- 改变 Launchpad 中应用图标的大小
  #+begin_src shell
  defaults write com.apple.dock springboard-columns -int 列数
  defaults write com.apple.dock springboard-rows -int 行数
  defaults write com.apple.dock ResetLaunchPad -bool TRUE
  killall Dock
  #+end_src

** Windows
* Self-hosting
[[https://github.com/awesome-selfhosted/awesome-selfhosted][awesome-selfhosted]]

This is a list of Free Software network services and web applications which can be hosted locally. Non-Free software is listed on the Non-Free page.

** Analytics
