index.html

<div id="outline-container-orgf54da15" class="outline-2">
<h2 id="orgf54da15"><span class="section-number-2">14</span> Text Editor</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org8422bc9" class="outline-3">
<h3 id="org8422bc9"><span class="section-number-3">14.1</span> Emacs</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li><a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org">mastering-emacs-in-one-year-guide/guide-zh.org at master · redguardtoo/mastering-emacs-in-one-year-guide</a></li>
<li><a href="http://planet.emacsen.org/">Planet Emacsen</a></li>
</ul>
</div>
</div>

<div id="outline-container-org828559c" class="outline-3">
<h3 id="org828559c"><span class="section-number-3">14.2</span> Spacemacs</h3>
<div class="outline-text-3" id="text-14-2">
<p>
<a href="https://github.com/syl20bnr/spacemacs">spacemacs</a> 是一款社区维护的 Emacs 配置，结合了 vim 和 Emacs 两者的优点。
</p>
</div>

<div id="outline-container-org8377144" class="outline-4">
<h4 id="org8377144"><span class="section-number-4">14.2.1</span> Dotfile Configuration</h4>
<div class="outline-text-4" id="text-14-2-1">
<p>
A dotdirectory <code>~/.spacemacs.d/</code> can be used instead of a dotfile. If you want to use this option, move <code>~/.spacemacs</code> to <code>~/.spacemacs.d/init.el</code>.
</p>

<p>
参考 <a href="https://github.com/zilongshanren/spacemacs-private">子龙山人的个人配置</a> 和 GeekPlux 的 <a href="https://github.com/geekplux/dotfiles">dotfiles</a>
</p>
</div>
</div>

<div id="outline-container-org74ed3a4" class="outline-4">
<h4 id="org74ed3a4"><span class="section-number-4">14.2.2</span> Tips</h4>
<div class="outline-text-4" id="text-14-2-2">
<ul class="org-ul">
<li><a href="https://github.com/syl20bnr/spacemacs/issues/3920">Environment variable warnings #3920</a> - Put <code>(setq exec-path-from-shell-arguments '("-l"))</code> in your <code>dotspacemacs/user-init</code></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfa0e51f" class="outline-2">
<h2 id="orgfa0e51f"><span class="section-number-2">15</span> Org Mode</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li><a href="http://doc.norang.ca/org-mode.html">Org Mode - Organize Your Life In Plain Text!</a></li>
<li><a href="https://orgmode.org/worg/index.html">Hello Worg, the Org-Mode Community!</a></li>
<li><a href="https://github.com/fniessen/refcard-org-mode">fniessen/refcard-org-mode</a> - Org mode syntax</li>
<li><a href="https://beorgapp.com/">beorg</a> - iOS | Recommand</li>
<li><a href="http://mobileorg.github.io/">Mobile Org</a> - iOS | Open Source</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">defun</span> <span style="color: #6c3163; font-weight: bold;">dotspacemacs/user-config</span> <span style="color: #6c3163;">()</span>
  <span style="color: #6c3163;">(</span><span style="color: #3a81c3; font-weight: bold;">with-eval-after-load</span> 'org
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> org-startup-indented t<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> org-html-doctype <span style="color: #2d9574;">"html5"</span><span style="color: #2d9574;">)</span>
    <span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/gongzhitaao/orgcss">gongzhitaao/orgcss</a>
</p>

<p>
When exported to HTML, there are three options for code highlighting, controlled by the variable <code>org-html-htmlize-output-type</code>.
</p>

<ol class="org-ol">
<li><p>
<code>(setq org-html-htmlize-output-type 'inline-css)</code>
</p>

<p>
This is the default setting. It highlights the code according to the current Emacs theme you are using. It directly applies color to the code with inline styles, e.g., <code>&lt;span style="color: 0x000000"&gt;int&lt;/span&gt;</code>.
</p>

<p>
The problem is that the highlight theme depends on the Emacs theme. If you use a dark theme in your Emacs but a light theme (usually we like light themed web pages) web pages, the exported code are hardly illegible due to the light font color, or vice versa.
</p></li>

<li><p>
<code>(setq org-html-htmlize-output-type nil)</code>
</p>

<p>
This configuration disables highlighting by <code>htmlize</code>. You may use a third-party Javascript highlight library. I recommend <a href="https://highlightjs.org/">highlight.js</a> if I need code highlight.
</p>

<p>
There are two problems:
</p>

<ol class="org-ol">
<li>The problem is that you have to rely on highlight.js support on a certain language which is occasionally missing, e.g., <code>emacs-lisp</code>, <code>org</code>, etc.</li>
<li><code>highlight.js</code> by default does not recognized the tags and classes exported by org mode. You need some extra Javascript code in your Org file.</li>
</ol></li>

<li><p>
<code>(setq org-html-htmlize-output-type 'css)</code>
</p>

<p>
This is similar to the first optional, instead of using inline styles, this will assign classes to each component of the code, e.g., <code>&lt;span class="org-type"&gt;int&lt;/span&gt;</code>, and you could create your own stylesheet for <code>.org-type</code>.
</p>

<p>
To obtain a list of all supported org classes, run <code>M-x org-html-htmlize-generate-css</code>.  This will create a buffer containing all the available org style class names in the current Emacs session.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgaf727a0" class="outline-2">
<h2 id="orgaf727a0"><span class="section-number-2">16</span> LaTeX</h2>
</div>
<div id="outline-container-org947997c" class="outline-2">
<h2 id="org947997c"><span class="section-number-2">17</span> OS</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgc96919b" class="outline-3">
<h3 id="orgc96919b"><span class="section-number-3">17.1</span> Linux</h3>
</div>
<div id="outline-container-org51505ee" class="outline-3">
<h3 id="org51505ee"><span class="section-number-3">17.2</span> MacOS</h3>
<div class="outline-text-3" id="text-17-2">
<ul class="org-ul">
<li><a href="https://github.com/jaywcjlove/awesome-mac">Awesome Mac</a></li>
<li><a href="https://github.com/serhii-londar/open-source-mac-os-apps">Awesome macOS open source applications</a></li>
<li><a href="https://github.com/robbyrussell/oh-my-zsh">oh-my-zsh</a></li>
<li><a href="http://brew.sh/">Homebrew</a>
<ul class="org-ul">
<li><a href="https://github.com/phinze/homebrew-cask">homebrew-cask</a></li>
<li><code>brew leavese</code> Show installed formulae that are not dependencies of another installed formula</li>
<li><a href="https://github.com/beeftornado/homebrew-rmtree">beeftornado/homebrew-rmtree</a> - Remove a formula and its unused dependencies</li>
</ul></li>
<li><a href="https://github.com/gnachman/iTerm2">iTerm2</a></li>
<li><a href="http://www.alfredapp.com/">Alfred</a>
<ul class="org-ul">
<li><a href="http://www.alfredworkflow.com/">alfredworkflow</a></li>
</ul></li>
</ul>
</div>

<div id="outline-container-org48d6941" class="outline-4">
<h4 id="org48d6941"><span class="section-number-4">17.2.1</span> Setup</h4>
<div class="outline-text-4" id="text-17-2-1">
<ul class="org-ul">
<li><a href="http://sourabhbajaj.com/mac-setup/index.html">Mac OS X Setup Guide</a></li>
<li><p>
改变 Launchpad 中应用图标的大小
</p>
<div class="org-src-container">
<pre class="src src-shell">defaults write com.apple.dock springboard-columns -int &#21015;&#25968;
defaults write com.apple.dock springboard-rows -int &#34892;&#25968;
defaults write com.apple.dock ResetLaunchPad -bool TRUE
killall Dock
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde6c7d9" class="outline-3">
<h3 id="orgde6c7d9"><span class="section-number-3">17.3</span> Windows</h3>
</div>
</div>
<div id="outline-container-org2f55f7d" class="outline-2">
<h2 id="org2f55f7d"><span class="section-number-2">18</span> Self-hosting</h2>
<div class="outline-text-2" id="text-18">
<p>
<a href="https://github.com/awesome-selfhosted/awesome-selfhosted">awesome-selfhosted</a>
</p>

<p>
This is a list of Free Software network services and web applications which can be hosted locally. Non-Free software is listed on the Non-Free page.
</p>
</div>
