index.html

<div id="outline-container-org920aa99" class="outline-3">
<h3 id="org920aa99"><span class="section-number-3">18.1</span> Analytics</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-orgde51e42" class="outline-4">
<h4 id="orgde51e42"><span class="section-number-4">18.1.1</span> Ackee</h4>
<div class="outline-text-4" id="text-18-1-1">
<p>
<a href="https://ackee.electerious.com/">Ackee</a> - Self-hosted analytics tool for those who care about privacy. <code>MIT</code> <code>Nodejs</code>
</p>

<p>
<a href="https://github.com/electerious/Ackee/blob/master/docs/SSL%20and%20HTTPS.md">SSL and HTTPS</a> - Nginx configuration
</p>
<div class="org-src-container">
<pre class="src src-conf"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Set "$cors_header" to avoid "if" inside location context</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://www.nginx.com/resources/wiki/start/topics/depth/ifisevil/</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">https://stackoverflow.com/questions/14499320/how-to-properly-setup-nginx-access-control-allow-origin-into-response-header-bas</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #ba2f59; font-weight: bold;">map $http_origin $cors_header</span> {
    default <span style="color: #2d9574;">""</span>;
    ~*^https://([^/]+\.)*(domainone|domaintwo)\.com$ $http_origin;
}

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Redirect all www to non-www</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #ba2f59; font-weight: bold;">server</span> {
    listen 80;
    listen 443 ssl;

    server_name www.example.com;

    ssl_certificate     /etc/letsencrypt/live/example.com/fullchain.pem;
    ssl_certificate_key /etc/letsencrypt/live/example.com/privkey.pem;

    return 301 https://example.com$request_uri;
}

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Redirect all non-encrypted to encrypted</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #ba2f59; font-weight: bold;">server</span> {
    listen 80;

    server_name example.com;

    return 301 https://example.com$request_uri;
}

<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">There we go</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span>
<span style="color: #ba2f59; font-weight: bold;">server</span> {
    listen 443 ssl http2;

    server_name example.com;

    ssl_certificate     /etc/letsencrypt/live/example.com/fullchain.pem;
    ssl_certificate_key /etc/letsencrypt/live/example.com/privkey.pem;

    access_log /var/log/nginx/log/example.com.access.log main;
    error_log  /var/log/nginx/log/example.com.error.log;

    <span style="color: #ba2f59; font-weight: bold;">location /</span> {
        add_header          Access-Control-Allow-Origin <span style="color: #2d9574;">"$cors_header"</span> always;
        add_header          Access-Control-Allow-Methods <span style="color: #2d9574;">"GET, POST, PATCH, OPTIONS"</span> always;
        add_header          Access-Control-Allow-Headers <span style="color: #2d9574;">"Content-Type"</span> always;
        add_header          Strict-Transport-Security <span style="color: #2d9574;">"max-age=31536000"</span> always;
        add_header          X-Frame-Options deny;
        proxy_pass          http://localhost:3000;
        proxy_next_upstream error timeout invalid_header http_500 http_502 http_503 http_504;
        proxy_redirect      off;
        proxy_buffering     off;
        proxy_set_header    Host $host;
        proxy_set_header    X-Real-IP $remote_addr;
        proxy_set_header    X-Forwarded-For $proxy_add_x_forwarded_for;
    }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Exuanbo</p>
<p class="date">Created: 2020-03-05 Thu 23:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
